Repository: cclauss/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/sourcing_and_processing_data/connectors/xml.po
Languages: it

source: XML connector
it: Connettore XML

source: This connector can create a dataset from an XML document.
it: Questo connettore permette di creare un dataset da un documento XML.

source: The provided document can have tags with arbitrary names but there are some constraints on the structure :
it: Il documento fornito può contenere tag con nomi arbitrari, tuttavia la struttura deve rispettare alcuni vincoli:

source: it must contain an array of objects, each object being used to create a record in the dataset,
it: deve contenere un array di oggetti, ciascuno utilizzato per creare un record del dataset;

source: the array can be anywhere in the XML document and can have any name,
it: l'array può trovarsi in qualsiasi punto del documento XML e può avere qualsiasi nome;

source: the objects must be flat, which means all their attributes must be at the root of the object,
it: gli oggetti devono essere flat, cioè tutti gli attributi devono trovarsi a livello radice dell'oggetto;

source: the first few objects must have all the attributes present in the file so the dataset's columns are correctly discovered.
it: i primi oggetti devono disporre di tutti gli attributi presenti nel file, per consentire la corretta rilevazione delle colonne del dataset.

source: Configuration
it: Configurazione

source: Name
it: Nome

source: Description
it: Descrizione

source: Values
it: Valori

source: Object path
it: Percorso dell'oggetto

source: Path to the first object in the XML document
it: Percorso del primo oggetto nel documento XML

source: e.g. /{namespace}arrayTag/objectTag
it: ad es. /{namespace}arrayTag/objectTag

source: Example file
it: File di esempio

source: In this example:
it: In questo esempio:

source: the root tag of the records is "shoppingList" (line 2), and the list of objects is in "basket" (line 5),
it: il tag radice dei record è "shoppingList" (riga 2) e l'elenco degli oggetti si trova in "basket" (riga 5);

source: the tag of the objects is "item",
it: il tag degli oggetti è "item";

source: each object has a "name" and a "quantity" attribute.
it: ciascun oggetto ha un attributo "name" e "quantity".

source: The object path is "/shoppingList/basket/item".
it: Il percorso dell'oggetto è "/shoppingList/basket/item".

source: Please note that tags **id**, **description**, **itemCount** and **totalQuantity** (tag names are arbitrary) will be ignored because they are not in any object.
it: Nota che i tag **id**, **description**, **itemCount** e **totalQuantity** (arbitrari) saranno ignorati, perché non sono presenti in alcuno degli oggetti.
