Repository: cclauss/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/using_api/v2/aggregations.po
Languages: it

source: Aggregations
it: Aggregazioni

source: To illustrate the general concept of the aggregation API, we'll consider a dataset describing daily sales for a number of stores worldwide, that is with the following fields:
it: Per illustrare il concetto generale delle API di aggregazione, esamineremo un dataset che descrive le vendite giornaliere di alcuni negozi di tutto il mondo, comprendente i seguenti campi:

source: store_name (string)
it: store_name (stringa)

source: store_address (string)
it: store_address (stringa)

source: store_country (string)
it: store_country (stringa)

source: store_coordinates (geo coordinates)
it: store_coordinates (coordinate geografiche)

source: sales_date (date)
it: sales_date (data)

source: sales_count (integer)
it: sales_count (numero intero)

source: sales_amount (decimal)
it: sales_amount (numero decimale)

source: The aggregate API allows the creation of virtual fields, limited to the request and that can be used in aggregates.
it: L'API aggregata permette di creare campi virtuali limitati alla richiesta, che possono essere utilizzati negli aggregati.

source: > Example: The daily average sale price for each store.
it: > Esempio: il prezzo medio di vendita giornaliero per ogni negozio.

source: The main function of the API is to group dataset records by a finite number of fields and to return aggregated values for other fields.
it: La funzione principale dell'API consiste nel raggruppare i record dei dataset in base a un numero finito di campi, restituendo i valori aggregati per altri campi.

source: > Example: the total sales count per country, the total sales amount and the average of daily average sale price.
it: > Esempio: numero totale delle vendite per paese, importo totale delle vendite e prezzo medio di vendita giornaliero.

source: It also allows for more complex aggregations.
it: Sono possibili, inoltre, aggregazioni più complesse.

source: > Example: the average price sale per country during the year: total sales amount / total sales count.
it: > Esempio: prezzo medio di vendita per paese nel corso dell'anno: importo totale delle vendite / numero delle vendite totali.

source: You can also join to each group a finite list of fetched values, that is values extracted from the group rows according to a criteria:
it: È inoltre possibile unire a ogni gruppo un elenco finito di valori recuperati, cioè estratti dalle righe del gruppo in base a un determinato criterio:

source: > Example: the best performing month (ie month with the most sales_amount) for each country.
it: > Esempio: il mese migliore (cioè il mese con il valore maggiore come sales_amount) per ogni paese.

source: All of the following would be summed up in the following request.
it: Il tutto viene riassunto nella seguente richiesta:

source: Which would then generate the following response
it: Che genera la seguente risposta:

source: See the API console for the full reference on the request's syntax.
it: Per i riferimenti completi sulla sintassi della richiesta, vedere la console API.

source: Aggregate functions
it: Funzioni di aggregazione

source: These functions accept as argument a field name or a virtual field and perform an aggregation function on its values. l
it: Queste funzioni accettano come argomento il nome di un campo o di un campo virtuale, ed eseguono una funzione di aggregazione sui relativi valori.

source: Example: still using the dataset described at the beginning, let's assume we want to 'cook the books' and report a little less sales each day and pocket the difference at the end of the year.
it: Esempio: utilizzando sempre il dataset descritto all'inizio, ipotizziamo di voler 'addomesticare' la contabilità e di inserire nei rendiconti una quantità un po' minore di vendite ogni giorno, per intascare la differenza alla fine dell'anno.

source: Arguments :
it: Argomenti:

source: ``field`` a decimal/integer field
it: ``field`` campo con un numero decimale/intero

source: ``STDDEV(field)`` standard deviation
it: ``STDDEV(field)`` deviazione standard

source: ``SUMSQUARES(field)`` sum of the squares
it: ``SUMSQUARES(field)`` somma dei quadrati

source: ```field`` a decimal/integer field
it: ``field`` campo con un numero decimale/intero

source: ``PERCENTILES(field, percents)`` a map of the percentiles values (indexed by percent) within the current group.
it: ``PERCENTILES(field, percents)`` mappa dei valori percentili (indicizzati per percentuale) nel gruppo corrente

source: Arguments:
it: Argomenti:

source: ``percents`` a list of percentages for which we want a percentile value. Can accept both integer and decimal percentages (ie both 99 and 99.9)
it: ``percents`` elenco delle percentuali per le quali desideriamo un valore percentile. Può accettare percentuali sia intere sia decimali (cioè sia 99 sia 99.9)

source: Examples:
it: Esempi:

source: ``PERCENTILES(my_decimal_field)`` -> ``{0: XX, 1: XY, ..., 99: YZ, 100: ZZ}``
it: ``PERCENTILES(mio_campo_decimale)`` -> ``{0: XX, 1: XY, ..., 99: YZ, 100: ZZ}``

source: ``PERCENTILES(my_decimal_field, [0, 50, 90, 99, 99.9])`` -> ``{0: XX, 50: XY, 90: YY, 99: YZ, 99.9: ZZ}``
it: ``PERCENTILES(mio_campo_decimale, [0, 50, 90, 99, 99.9])`` -> ``{0: XX, 50: XY, 90: YY, 99: YZ, 99.9: ZZ}``

source: Incremental functions for aggregates
it: Funzioni incrementali per gli aggregati

source: All of the above functions are also available in an ``INCREMENTAL`` version. That is the result of the computation for the current group is added to the result of the previous group and returned. ` In mathematical terms:
it: Tutte le suddette funzioni sono disponibili anche in versione ``INCREMENTAL``. Il risultato del calcolo ottenuto per il gruppo corrente viene aggiunto ai risultati del gruppo precedente e restituito. In termini matematici:

source: f_n is the result of the aggregation function for group i
it: f_n è il risultato della funzione di aggregazione per il gruppo i

source: g_n is the result of the incremental aggregation function for group i
it: g_n è il risultato della funzione di aggregazione incrementale per il gruppo i

source: g_n = sum of f_i for all values of i between 0 and n
it: g_n = somma di f_i per tutti i valori di i tra 0 e n

source: Incremental function is:
it: La funzione incrementale è:

source: ``INCREMENTAL``. For example: ``INCREMENTAL(SUM(fiel))``
it: ``INCREMENTAL``. Ad esempio: ``INCREMENTAL(SUM(fiel))``

source: Group by functions
it: Funzioni di raggruppamento

source: Used to split ``aggregates`` results by field values. ``group_by`` attribute takes a list of group_by expressions. The result will be sorted, depending of group_by field values. For instance ``group_by[store_country, store_name]`` will return :
it: Permettono di dividere i risultati degli ``aggregates`` in base ai valori dei campi. L'attributo ``group_by`` considera un elenco di espressioni group_by. Il risultato viene ordinato a seconda dei valori del campo group_by. Ad esempio, ``group_by[store_country, store_name]`` restituirà:

source: A group_by name needs to be set for complex group_by expression (date or range). A valid name is composed of lower chars [a-z] and digit [0-9] and ``_``. The group_by expression becomes a dict containing aggregation name and aggregation expression:
it: Per le espressioni group_by complesse (data o intervallo) è necessario impostare un nome group_by. Un nome valido può contenere caratteri minuscoli [a-z], numeri [0-9] e il carattere ``_``. L'espressione group_by diventa un dict contenente il nome e l'espressione di aggregazione:

source: Example:
it: Esempio:

source: Simple field
it: Campo semplice

source: Group by all field values. For instance ``group_by:[field_name]`` group by ``aggregates`` functions by every values of ``field_name`` field.
it: Raggruppa in base a tutti i valori di un campo. Ad esempio, ``group_by:[nome_campo]`` esegue il raggruppamento tramite le funzioni ``aggregates`` per ogni valore del campo ``nome_campo``.

source: Date functions
it: Funzioni di data

source: ``date(myfield, format)`` Format a date object
it: ``date(miocampo, format)`` Formato di un oggetto data

source: ``myfield`` a date/datetime field
it: ``miocampo`` campo data o data/ora

source: ``format`` a string (see below for accepted values)
it: ``format`` stringa (vedere sotto per i valori ammessi)

source: format_date(myfield, 'yyyy-MM-dd HH:mm:ss')
it: format_date(miocampo, 'yyyy-MM-dd HH:mm:ss')

source: Format options:
it: Opzioni di formato:

source: The ``date`` method is a wrapper for http://joda-time.sourceforge.net/apidocs/org/joda/time/format/DateTimeFormat.html and therefore accepts the same inputs.
it: Il metodo ``date`` è un wrapper per http://joda-time.sourceforge.net/apidocs/org/joda/time/format/DateTimeFormat.html e accetta quindi gli stessi input.

source: *G* era (text) example: AD
it: *G* era (testo) esempio: AD

source: *C* century of era (>=0) (number) example: 20
it: *C* secolo dell'era (>=0) (numero) esempio: 20

source: *Y* year of era (>=0) (year) example: 1996
it: *Y* anno dell'era (>=0) (anno) esempio: 1996

source: *x* weekyear (year) example: 1996
it: *x* weekyear (anno) esempio: 1996

source: *w* week of weekyear (number) example: 27
it: *w* settimana del weekyear (numero) esempio: 27

source: *e* day of week (number) example: 2
it: *e* giorno della settimana (numero) esempio: 2

source: *E* day of week (text) example: Tuesday; Tue
it: *E* giorno della settimana (testo) esempio: Tuesday; Tue

source: *y* year (year) example: 1996
it: *y* anno (anno) esempio: 1996

source: *D* day of year (number) example: 189
it: *D* giorno dell'anno (numero) esempio: 189

source: *M* month of year (month) example: July; Jul; 07
it: *M* mese dell'anno (mese) esempio: July; Jul; 07

source: *d* day of month (number) example: 10
it: *d* giorno del mese (numero) esempio: 10

source: *a* halfday of day (text) example: PM
it: *a* mezza giornata (testo) esempio: PM

source: *K* hour of halfday (0~11) (number) example: 0
it: *K* ora della mezza giornata (0~11) (numero) esempio: 0

source: *h* clockhour of halfday (1~12) (number) example: 12
it: *h* ora di orologio della mezza giornata (1~12) (numero) esempio: 12

source: *H* hour of day (0~23) (number) example: 0
it: *H* ora del giorno (0~23) (numero) esempio: 0

source: *k* clockhour of day (1~24) (number) example: 24
it: *k* ora di orologio del giorno (1~24) (numero) esempio: 24

source: *m* minute of hour (number) example: 30
it: *m* minuto dell'ora (numero) esempio: 30

source: *s* second of minute (number) example: 55
it: *s* secondo di un minuto (numero) esempio: 55

source: *S* fraction of second (number) example: 978
it: *S* frazione di secondo (numero) esempio: 978

source: *z* time zone (text) example: Pacific Standard Time; PST
it: *z* fuso orario (testo) esempio: Pacific Standard Time; PST

source: *Z* time zone offset/id (zone) example: -0800; -08:00; America/Los_Angeles
it: *Z* differenza fuso orario/ID (zona) esempio: -0800; -08:00; America/Los_Angeles

source: *'* escape for text (delimiter)
it: *'* escape per testo (delimitatore)

source: *''* single quote (literal) example: '
it: *''* virgolette singole (letterale) esempio: '

source: The count of pattern letters determine the format.
it: Il numero delle lettere del pattern determina il formato.

source: *Text* If the number of pattern letters is 4 or more, the full form is used; otherwise a short or abbreviated form is used if available.
it: *Testo*: se il numero delle lettere del pattern è maggiore o uguale a 4, viene utilizzata la forma completa, altrimenti, se disponibile, si utilizza una forma breve o abbreviata.

source: *Number* The minimum number of digits. Shorter numbers are zero-padded to this amount.
it: *Numero*: numero minimo di caratteri. I numeri più corti vengono completati aggiungendo gli zeri necessari al raggiungimento del numero minimo.

source: *Year* Numeric presentation for year and weekyear fields are handled specially. For example, if the count of 'y' is 2, the year will be displayed as the zero-based year of the century, which is two digits.
it: *Anno*: la presentazione numerica dei campi year e weekyear viene gestita in modo speciale. Ad esempio, se il numero di 'y' è 2, verranno visualizzate solo le ultime due cifre dell'anno, senza il riferimento del secolo.

source: *Month* 3 or over, use text, otherwise use number.
it: *Mese* per 3 o più, si utilizza il testo, altrimenti si utilizza il numero.

source: *Zone* 'Z' outputs offset without a colon, 'ZZ' outputs the offset with a colon, 'ZZZ' or more outputs the zone id.
it: *Fuso orario*: 'Z' dà come output la differenza senza i due punti, 'ZZ' dà come output la differenza con i due punti, 'ZZZ' o più dà come output l'ID zona.

source: *Zone names* Time zone names ('z') cannot be parsed.
it: *Nome fuso orario* I nomi dei fusi orari ('z') non possono essere analizzati.

source: Any characters in the pattern that are not in the ranges of ['a'..'z'] and ['A'..'Z'] will be treated as quoted text. For instance, characters like ':', '.', ' ', '#' and '?' will appear in the resulting time text even they are not embraced within single quotes.
it: Qualsiasi carattere del pattern che non rientri negli intervalli ['a'..'z'] e ['A'..'Z'] verrà considerato come testo tra virgolette. Ad esempio, caratteri come ':', '.', ' ', '#' e '?' verranno mostrati nel testo del tempo anche se non sono racchiusi tra virgolette singole.

source: A full example:
it: Esempio completo:

source: Range functions
it: Funzioni di intervallo

source: The following functions all perform discretization functions on the dataset's values.
it: Le seguenti sono tutte funzioni di discretizzazione eseguite sui valori dei dataset.

source: In all of them, ``myfield`` is an integer or decimal field.
it: In tutte, ``miocampo`` indica un campo con un numero intero o decimale.

source: ``range(myfield, equi(num_ranges, lowest_boundary, highest_boundary))``
it: ``range(miocampo, equi(num_ranges, lowest_boundary, highest_boundary))``

source: Divides the [lowest_boundary, highest_boundary] global value interval in num_ranges equally wide sub ranges.
it: Divide l'intervallo globale dei valori [lowest_boundary, highest_boundary] in un numero (num_ranges) di sotto-intervalli di uguali dimensioni.

source: If lowest_boundary (resp. highest_boundary) is not set, then the lowest_boundary (resp. highest_boundary) of the global interval will be the minimum (resp. maximum) value of the dataset.
it: Se lowest_boundary (o highest_boundary) non è impostato, il lowest_boundary (o highest_boundary) dell'intervallo globale sarà il valore minimo (o massimo) del dataset.

source: If lowest_boundary (resp. highest_boundary) is higher (resp. lower) than the mininum (resp. maximum) value of the dataset, an additional sub range [min_value; lowest_boundary[ (resp. [highest_boundary; max_value]) will be added to the num_ranges sub-ranges.
it: Se lowest_boundary (o highest_boundary) è maggiore (o minore) del valore minimo (o massimo) del dataset, verrà aggiunto un ulteriore sotto-intervallo [min_value; lowest_boundary[ (o [highest_boundary; max_value]) al numero (num_ranges) di sotto-intervalli.

source: ``myfield`` **required** a decimal field
it: ``miocampo`` campo decimale **obbligatorio**

source: ``num_ranges`` **required** number of ranges to create from the values
it: ``num_ranges`` numero **obbligatorio** di intervalli da creare con i valori

source: ``lowest_boundary`` **optional** lowest boundary of the num_ranges ranges
it: ``lowest_boundary`` limite inferiore **facoltativo** al numero ("num_ranges") di intervalli

source: ``highest_boundary`` **optional** highest boundary of the num_ranges ranges
it: ``highest_boundary`` limite superiore **facoltativo** al numero ("num_ranges") di intervalli

source: Example: myfield values are [ -5, -2, -1, 0, 3, 4, 5, 120]
it: Esempio: i valori di "miocampo" sono [ -5, -2, -1, 0, 3, 4, 5, 120]

source: ``range(myfield, equi(5))`` will create the subranges
it: ``range(miocampo, equi(5))`` creerà i seguenti sotto-intervalli:

source: ``range(myfield, equi(5, lowest_boundary=0))`` will create the subranges
it: ``range(miocampo, equi(5, lowest_boundary=0))`` creerà i seguenti sotto-intervalli:

source: ``range(myfield, equi(5, highest_boundary=10))`` will create the subranges
it: ``range(miocampo, equi(5, highest_boundary=10))`` creerà i seguenti sotto-intervalli:

source: ``range(myfield, equi(5, lowest_boundary=0, highest_boundary=10))`` will create the subranges
it: ``range(miocampo, equi(5, lowest_boundary=0, highest_boundary=10))`` creerà i seguenti sotto-intervalli:

source: ``range(myfield, static(divisions))``
it: ``range(miocampo, static(divisions))``

source: Divides the full range of myfield values in sub ranges delimited by the values set in divisions.
it: Divide l'intero intervallo dei valori di "miocampo" in sotto-intervalli delimitati dai valori impostati nelle divisioni.

source: If the minimum (resp. maximum) existing value of myfield in lower (resp. higher) than the lowest (resp. highest) division value, an additional range will be added so that all of myfield values are accounted for.
it: Se il valore minimo (o massimo) esistente di "miocampo" è minore (o maggiore) del valore minimo (o massimo) di divisione, verrà aggiunto un ulteriore intervallo, in modo che tutti i valori di "miocampo" siano presenti.

source: ``division`` **required** an ordered (ASC) list of decimal values
it: ``division`` elenco ordinato (ASC) **obbligatorio** di valori decimali

source: ``range(myfield, static([-1000, -10, -1, 0, 1, 10, 1000]))`` will create the sub ranges
it: ``range(miocampo, static([-1000, -10, -1, 0, 1, 10, 1000]))`` creerà i seguenti sotto-intervalli:

source: ``range(myfield, static([-10, 0, 10]))`` will create the sub ranges
it: ``range(miocampo, static([-10, 0, 10]))`` creerà i seguenti sotto-intervalli:

source: ``range(myfield, static([0, 10, 100, 1000]))`` will create the sub ranges
it: ``range(miocampo, static([0, 10, 100, 1000]))`` creerà i seguenti sotto-intervalli:

source: ``range(myfield, percentile())`` Return the number of the percentile within which myfield's value lies. (default: [1, 5, 25, 50, 75, 95, 99])
it: ``range(miocampo, percentile())`` Restituisce il numero del percentile all'interno del quale si trova il valore di "miocampo" (predefinito: [1, 5, 25, 50, 75, 95, 99]).

source: ``range(myfield, median())`` Return the number of the median within which myfield's value lies.
it: ``range(miocampo, median())`` Restituisce il numero della mediana all'interno della quale si trova il valore di "miocampo".

source: ``range(myfield, decile())`` Return the number of the decile within which myfield's value lies. (1 to 10)
it: ``range(miocampo, decile())`` Restituisce il numero del decile all'interno del quale si trova il valore di "miocampo" (da 1 a 10).

source: ``range(myfield, quartile())`` Return the number of the quartile within which myfield's value lies. (1 to 4)
it: ``range(miocampo, quartile())`` Restituisce il numero del quartile all'interno del quale si trova il valore di "miocampo" (da 1 a 4).
