Repository: cclauss/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publish_datasets/citadeljson.po
Languages: fr

source: Configuring a dataset for Citadel JSON
fr: Configurer un jeu de données pour Citadel JSON

source: **Citadel JSON** is a POI (Point Of Interest) format designed by the `CitadelOnTheMove <http://www.citadelonthemove.eu/>`_ project; a Citadel JSON file can be used with `a variety of tools <http://www.citadelonthemove.eu/en-us/createanapp/developerpage.aspx>`_ to build applications around geolocalized data. You can configure each of your dataset to be exportable as a Citadel JSON file, if it contains geographical data.
fr: **Citadel JSON** est un format POI (Point Of Interest) conçu par le projet `CitadelOnTheMove <http://www.citadelonthemove.eu/>`_; un fichier Citadel JSON peut être utilisé avec `différents outils <http://www.citadelonthemove.eu/en-us/createanapp/developerpage.aspx>`_ pour générer ou développer des applications à partir de données géolocalisées. Vous pouvez configurer chacun de vos jeux de données pour être exportable sous format Citadel JSON, à condition qu'il contienne des données géographiques.

source: By default, you won't have the Citadel JSON configuration form in your interface; contact us (using the support form for example) to have it activated.
fr: Par défaut, le formulaire de configuration Citadel JSON ne sera pas visible dans votre interface; vous pouvez nous contacter (par le formulaire de support par exemple) afin que nous l'activions.

source: The Citadel JSON format is strongly structured, which means it requires very specific information in very specific places; as it can't really know by itself which field is what you consider the "description" of the "categories", you need to configure by yourself which field plays which role. The following information is expected for each record:
fr: Le format Citadel JSON est fortement structuré, ce qui signifie qu'il nécessite des informations spécifiques à des endroits spécifiques; étant donné qu'il est impossible de déduire automatiquement quel champ doit être considéré comme étant une "description" ou une "catégorie", vous devez configurer manuellement quel champ jouera quel rôle. Le format s'attend à déduire de chaque enregistrement les informations suivantes:

source: a title (the name of a school...)
fr: un titre (le nom d'une école...)

source: a description (a longer description of the point of interest; can be left empty although it is not recommended)
fr: une description (une description plus longue du point d'intérêt; elle peut être vide mais ce n'est pas recommandé)

source: one or more categories
fr: une ou plusieurs catégories

source: a localisation (automatically filled by OpenDataSoft, no need for configuration)
fr: une localisation (automatiquement fourni par OpenDataSoft, pas de configuration nécessaire)

source: an address, a postal code, and a city, in three separate fields
fr: une adresse, un code postal, et une ville, dans 3 champs séparés

source: In the publish console of your dataset, at the bottom of the "Informations" tab, you will find a "Citadel JSON" tab. There, you will be able to configure the required information by filling the name (not the label!) of the field that contains this information for each record.
fr: Dans la console de publication de votre jeu de données, au bas de l'onglet "Informations", vous trouverez un onglet "Citadel JSON". Un formulaire vous permettra de configurer les informations nécessaires en saisissant le nom du champ (et non le label) contenant l'information pour chaque enregistrement.

source: Once saved and published, your users will be able to download the dataset as Citadel JSON.
fr: Une fois enregistré et publié, vos utilisateurs pourront télécharger le jeu de données en Citadel JSON.
