Repository: cclauss/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/publish_datasets/configure_visualizations.po
Languages: fr

source: Configuring visualizations
fr: Configurer les visualisations

source: When you create your dataset, data visualizations become available depending on your data (for example, having geographical location enables maps). Each of these visualizations have their own configuration panel, so that you can further define the right appearance for your data.
fr: Lorsque vous créez un jeu de données, certains types de visualisations deviennent disponibles en fonction de la nature des données (par exemple, avoir des coordonnées géographiques permet un affichage sur une carte). Chacune de ces visualisations dispose d'un panneau de configuration dédié, afin de pouvoir définir plus finement l'apparence de vos données.

source: Not all visualizations are available for all datasets. Here only *Table*, *Map* and *Analyze* are available.
fr: Toutes les visualisations ne sont pas disponibles pour tous les jeux de données. Ainsi, ici seuls *Tableau*, *Carte* et *Analyse* sont disponibles.

source: Table view
fr: Vue tableau

source: The table view is always available on all non-empty datasets.
fr: La vue tableau est toujours disponible sur les jeux de données non vides.

source: You can configure which fields are displayed, and in which order. Note that it only changes the table visualization; removing a field from the table view will not remove it from the dataset itself, and it will still be available in other visualizations and if you export the dataset.
fr: Vous pouvez configurer quels champs sont affichés, ainsi que leur ordre. Notez que cela n'agit que sur la vue tableau; retirer un champ de cette vue ne va pas le retirer du jeu de données, et ce champ sera toujours disponible dans les autres visualisations et lors d'un export du jeu de données.

source: Map view
fr: Vue carte

source: The map view is only available to datasets containing at least one geo field (geo point or geo shape).
fr: La vue carte est uniquement disponible pour les jeux de données contenant au moins un champ géographique (point géo ou forme géo).

source: You can configure the appearance of the map itself:
fr: Vous pouvez configurer l'apparence de la carte elle-même :

source: If a tooltip displays more than one item (when multiple records have the same location for example), you can set their relative order
fr: Si une infobulle doit afficher plus d'un seul élément (par exemple lorsqu'il existe plusieurs enregistrements sur le même emplacement géographique), vous pouvez configurer l'ordre dans lequel ils apparaissent

source: If you have more than one basemap on your domain, you can set which one is selected by default for this dataset (otherwise it is the first one in the list)
fr: Si vous avez plus d'un fond de carte configuré sur votre domaine, vous pouvez configurer lequel sera sélectionné par défaut pour ce jeu de données (autrement, le premier de la liste sera sélectionné)

source: The color of the shapes and points displayed on the map
fr: La couleur des formes et points affichés sur la carte

source: If the data is represented as points, you can configure how it is displayed: a simple icon, little dots, or a familiar marker
fr: Si les données sont représentées par des points, vous pouvez configurer leur affichage: une simple icône, un petit point, ou un marqueur plus familier

source: The map view options
fr: Les options de la vue carte

source: You can also configure the tooltips displayed when you click on a point or shape on the map. Tooltips can be either "standard" or "custom". Standard tooltips allow you to simply choose a field to be the title of the tooltips, and which fields are displayed. Custom tooltips allow you to write the entire tooltip's HTML; see `Custom HTML tooltips`_ for more information.
fr: Vous pouvez aussi configurer l'affichage des infobulles qui apparaissent lorsque l'utilisateur clique sur un point ou une forme sur la carte. Les infobulles peuvent être "standards" ou "personnalisés". Les infobulles standards vous permettent de choisir simplement quel champ sera le titre de l'infobulle, et quels champs sont affichés. Les infobulles personnalisées vous permettent d'écrire intégralement le HTML; voir `Infobulles personnalisées en HTML`_ pour plus d'information.

source: Images view
fr: Vue images

source: The images view is only available when there is at least a *file* field, and if at least one file contained in this field is an image, or a document that can generate a thumbnail.
fr: La vue images est uniquement disponible s'il y a au moins un champ *fichier*, et si au moins un des fichiers contenus dans ce champ est une image, ou un document qui peut servir à générer un aperçu en image.

source: You can configure the tooltip displayed when you click on each image. This is similar to the map view's tooltips: you can either keep a "standard" tooltip and configure which field is the title and which fields are displayed; or you can configure a "custom" tooltip and write the tooltip's HTML by yourself; see `Custom HTML tooltips`_ for more information.
fr: Vous pouvez configurer l'infobulle affichée lorsqu'un utilisateur clique sur une des images. De façon similaire à l'infobulle de la vue carte, vous pouvez soit choisir une infobulle "standard" et configurer quel champ sera le titre et quels champs seront affichés, ou choisir une infobulle "personnalisée" et écrire l'intégralité du HTML; voir `Infobulles personnalisées en HTML`_ pour plus d'information.

source: Analyze view
fr: Vue analyse

source: The analyze view is available on all datasets having at least a date/datetime field or a facet.
fr: La vue analyse est disponible sur les jeux de données comportant au moins un champ date/datetime ou une facette.

source: The analyze options
fr: Les options d'analyse

source: You can configure which chart will be displayed by default, using the same interface and options as the visualization itself. This allows you to directly decide which chart would be the most relevant to your users.
fr: Vous pouvez configurer quel graphique sera affiché par défaut, en utilisant la même interface que sur la visualisation elle-même. Cela vous permet de vous assurer que le graphique affiché par défaut sera le plus pertinent pour vos utilisateurs.

source: :doc:`Learn more about the charts interface</explore/simple_charts>`.
fr: :doc:`En savoir plus à propos des graphiques </explore/simple_charts>`.

source: Calendar view
fr: Vue calendrier

source: The calendar view is only available to datasets containing at least 2 datetime fields and a text field.
fr: La vue calendrier est uniquement disponible sur les jeux de données contenant au moins 2 champs datetime et un champ texte.

source: By default, the calendar view is not enabled; if your dataset has two or more date or datetime fields, you can activate it and configure which fields represent the start and end of the displayed items.
fr: Par défaut, la vue calendrier n'est pas active; si le jeu de données dispose d'au moins deux champs date ou datetime, vous pouvez l'activer et configurer quels champs représentent le début et la fin des éléments affichés.

source: Once activated, you can also configure which views are available (month, week, day) and which one is displayed by default. You can also configure which fields are displayed in the tooltip when you click on an item.
fr: Une fois activée, vous pouvez également configurer les vues disponibles (mois, semaine, jour), ainsi que celle qui sera affichée par défaut. Vous pouvez aussi configurer quels champs sont affichés dans l'infobulle qui apparait lorsque l'utilisateur clique sur un élément.

source: The full list of options is detailed in length on the dedicated :doc:`configuring a dataset for calendar view </explore/calendars>` page.
fr: La liste exhaustive des options est exposée en détail sur la page dédiée à la :doc:`configuration de la vue calendrier</explore/calendars>`.

source: Custom HTML tooltips
fr: Infobulles personnalisées en HTML

source: Map and images views' tooltips can be configured as entirely custom tooltips; you are able to write the HTML code used to display each tooltip.
fr: Les infobulles des vues cartes et images peuvent être intégralement personnalisés; vous pouvez écrire le code HTML utilisé pour l'affichage de ces infobulles.

source: To switch from the standard tooltip configuration interface to this custom tooltip view, select *Custom HTML template* from the *tooltip type* dropdown menu.
fr: Pour passer de l'interface de configuration standard à la configuration d'infobulle personnalisée, choisissez "Infobulle personnalisée en HTML" depuis la liste déroulant "Type d'infobulle".

source: An example of a custom tooltip.
fr: Un exemple d'infobulle personnalisée.

source: This is very similar to writing "pages" in your domain; you have access to every `ODS Widget <http://opendatasoft.github.io/ods-widgets/docs/>`_ and you can even integrate other visualizations inside the tooltip. You can even use the :doc:`grid layout classes</look_and_feel/grid-layouts>`.
fr: L'approche est similaire à l'écriture de "pages" sur votre domaine; vous pouvez utiliser n'importe quel `ODS Widget <http://opendatasoft.github.io/ods-widgets/docs/>`_ et même intégrer d'autres visualisations dans l'infobulle. Vous pouvez même utiliser les :doc:`classes de mise en page</look_and_feel/grid-layouts>`.

source: When the tooltip is displayed, it can access a specific ``record`` variable that is "injected" in the tooltip. This ``record`` object contains the following properties:
fr: Lorsque l'infobulle s'affiche, une variable ``record`` est "injectée" et est disponible pour être utilisée. Cet objet ``record`` contient les propriétés suivantes :

source: ``record.fields``: object containing all the values (e.g. ``record.fields.tree_height``)
fr: ``record.fields``: objet contenant toutes les valeurs de l'enregistrement (par ex. ``record.fields.tree_height``)

source: ``record.recordid``: unique identifier for the record
fr: ``record.recordid``: identifiant unique de cet enregistrement

source: ``record.datasetid``: identifier of the dataset
fr: ``record.datasetid``: identifiant du jeu de données

source: Using these properties, you can display directly values in the tooltip, or even use them to display data from other datasets.
fr: Grâce à ces propriétés, vous pouvez afficher directement les valeurs dans l'infobulle, ou même les utiliser pour afficher des données depuis d'autres jeux de données.

source: The schema of the dataset is also injected as a ``fields`` variable, which is an array of field objects (you can use ``ng-repeat`` to loop over the fields). A field object contains the following properties:
fr: Le schéma du jeu de données est également injecté sous la forme d'une variable ``fields``, qui contient un tableau d'objets représentant les champs (vous pouvez utiliser ``ng-repeat`` pour faire une boucle sur ces champs). Un objet champ (ici "field") contient les propriétés suivantes :

source: ``field.name``: the identifier of the field, for example to find a value within ``record.fields``
fr: ``field.name`` : l'identifiant du champ, par exemple pour récupérer une valeur à l'intérieur de ``record.fields``

source: ``field.type``: the type of the field (``text``, ``decimal``, ``integer``, ``date``, ``datetime``, ``geo_point_2d``, ``geo_shape``)
fr: ``field.type`` : le type du champ (``text``, ``decimal``, ``integer``, ``date``, ``datetime``, ``geo_point_2d``, ``geo_shape``)

source: ``field.label``: a human-friendly label
fr: ``field.label`` : un label destiné à l'affichage

source: If you want to display an image from one of your dataset's ``file`` fields, you can use the ``ods-record-image`` widget, as in the example below.
fr: Si vous souhaitez afficher une image depuis un des champs ``file`` de l'enregistrement, vous pouvez utiliser le widget ``ods-record-image`` comme dans l'exemple ci-dessous.

source: You can use a ``<ods-dataset-context>`` to display a visualization from another dataset; in the following example, the data is taken from another dataset and filtered using one of the values of the selected record.
fr: Vous pouvez utiliser un ``<ods-dataset-context>`` pour afficher une visualisation à partir d'un autre jeu de données; dans l'exemple suivant, les données sont récupérées à partir d'un autre jeu de donnée qui a été filtré à partir d'une des valeurs de l'enregistrement sélectionné.

source: Custom view
fr: Vue personnalisée

source: Standard views allow your users to dive further into your datasets, but they are tools. They do not provide additional context and do not highlight what you think are the key facts to take away. And while the *description* metadata adds a bit of context, it is limited to pure text.
fr: Les vues standards permettent à vos utilisateur d'explorer en profondeur vos jeux de données mais ce ne sont que des outils. Ils ne fournissent pas de contexte à cette exploration de données et ne mettent pas en valeur ce que vous considérez comme les éléments clés à retenir de tel ou tel jeu de données. La métadonnée *description* permet de définir le contexte général mais est limitée à du texte.

source: The custom view is an additional tab that lives alongside the other tabs on the dataset's page. It is an empty space that you can use as you wish. An HTML and CSS editor enables you to write a dashboard as simple or as complex as you may want (for more information about writing beautiful dashboard, see the :doc:`dedicated documentation </publish_content>`) and you can even customize the title and icon of this additional tab.
fr: La vue personnalisée est un onglet supplémentaire s'insérant au milieu des autres sur la page d'un jeu de données. C'est un espace qui vous est réservé et que vous pouvez utiliser comme bon vous semble. Un éditeur HTML et CSS vous permet d'écrire un tableau de bord aussi simple ou complexe que vous le voulez (pour plus d'information sur comment écrire un tableau de bord, reportez vous à :doc:`la section de documentation correspondante </publish_content>`). Vous pouvez même personnalisé le titre et l'icône de cet onglet.

source: The custom view editor
fr: L'éditeur de vue personnalisée

source: The custom title and icon will show up within your catalog page on the related dataset's card, and you'll be able to search for datasets having a custom view set up with the *View* filter (select the *Custom view* option).
fr: Le titre et l'icône personnalisée apparaitront dans la page de catalogue, sur la carte du jeu de données concerné. Vous pourrez par ailleurs rechercher les jeux de données présentant une vue personnalisée grâce au filtre *Vue* (en sélectionnant l'option *Vue personnalisée*).

source: Icons are taken from the `Font awesome 4.7 icon set <http://fontawesome.io/icons/>`_ and must be specified through their name (omitting the ``fa-`` prefix). For example, to use the `bar chart <http://fontawesome.io/icon/bar-chart/>`_ icon, whose name is ``fa-bar-chart``, you should input ``bar-chart`` in the icon field. You can also leave this field empty, in which case it will default to the `tachometer icon <http://fontawesome.io/icon/tachometer/>`_.
fr: Les icônes sont tirées de l'ensemble `Font Awesome 4.7 <http://fontawesome.io/icons/>`_ et doivent être appelées par leur nom (sans le préfixe ``fa-``). Par exemple, pour utiliser l'icône `graphique en barre <http://fontawesome.io/icon/bar-chart/>`_, dont le nom est ``fa-bar-chart``, vous devez indiquer ``bar-chart`` dans le champs icône. Si vous laissez ce champs vide, la valeur par défaut utilisée sera l'`icône tachymètre <http://fontawesome.io/icon/tachometer/>`_.
