Repository: cclauss/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/manage_domain/security.po
Languages: fr

source: Managing the Security of your Domain
fr: Gérer la sécurité de votre domaine

source: OpenDataSoft's security model
fr: Le modèle de sécurité de OpenDataSoft

source: OpenDataSoft provides a full stack security layer with users, groups and roles management. Using this security layer, you can restrict the access to your dataset's catalog as well as to the content of a single dataset.
fr: La plateforme OpenDataSoft offre une couche de sécurité complète, avec une gestion d'utilisateurs, de groupes et de rôles. En utilisant cette couche de sécurité, vous pouvez restreindre l'accès à votre catalogue de données ainsi qu'au contenu de jeux de données individuels.

source: An OpenDataSoft domain can be kept private or can be made public. When set to private, a domain can only be accessed by users defined in the access list of the domain. When set to public, a domain can be accessed by anyone (this however does not mean that any user will be able to browse the entire domain catalog).
fr: Un domaine OpenDataSoft peut être privé ou public. Lorsqu'il est privé, un domaine ne peut être visité que pas des utilisateurs dans la liste d'accès du domaine. Lorsqu'il est publique, un domaine est accessible au monde entier (ce qui ne veut en revanche pas dire que tous les utilisateurs pourront consulter l'ensemble du catalogue de données du domaine).

source: The domain access list is made of users and groups of users to which permissions are attached. Two different set of permissions can be defined: permissions related to regular users and permissions related to admin users (those guys with super powers). The permissions make it possible to allow users to read the dataset catalog, create and publish new datasets or even visualize and modify any dataset of the domain.
fr: La liste d'accès du domaine est composée de groupes et d'utilisateurs auxquels sont attachées des permissions. Ces permissions sont classées dans deux grands groupes: les permissions d'utilisateurs normaux et les permissions d'administrateurs (pour les super-héros des données). Ces permissions permettent d'autoriser des utilisateurs à lire le catalogue de données, à créer et publier des nouveaux jeux de données ou même à accéder et modifier n'importe quel jeu de données du domaine.

source: Then, at the dataset level, it is possible to even further refine the security model by giving specific access to users or groups to either view or modify the dataset. It is also possible to define advanced filters so that a given user will only see some fields and/or a subset of the dataset records.
fr: Au niveau du jeu de données, il est possible d'affiner encore plus le modèle de sécurité en donnant des accès spécifiques aux utilisateurs et groupes, afin qu'ils puissent consulter ou modifier le jeu de données. Il est également possible de définir des filtres avancés de sorte qu'un utilisateur ne puisse voir que certains champs ou même un sous ensemble des enregistrements contenus dans le jeu de données.

source: Configuring your domain's security policy
fr: Configurer la politique de sécurité de votre domaine

source: Domain access and default security policy
fr: Accès au domaine et politique de sécurité par défaut

source: Check the option **allow anonymous access** if you want to let people access your domain without having to log in. Anonymous users will only be able to access non restricted datasets. This makes it possible to mix on the single domain a public facing catalog and a private catalog that can only be accessed by authorized users.
fr: Cochez l'option **Autoriser l'accès anonyme** si vous voulez permettre aux utilisateurs d'accéder à votre domaine sans devoir s'identifier. Les utilisateurs anonymes ne pourront accéder qu'aux jeux de données qui ne sont pas restreints. Cette subtilité permet de mélanger, sur un même domaine, un catalogue publique et un catalogue privé ne pouvant être consulté que par les utilisateurs autorisés.

source: Datasets access can be set to be *restricted* or *not restricted*. A *restricted* dataset can only be accessed by authorized users (users who are in the access list of the dataset, see below). Check the option **restrict new datasets by default** if you want newly created datasets to be accessed only by authorized users.
fr: L'accès aux jeux de données peut être *restreint* et *non restreint*. Un jeu de données restreint ne peut être consulté que par les utilisateurs autorisés (c'est à dire ajoutées dans la liste d'accès du jeu de données, pour ce faire, voir les instructions plus bas). Cochez l'option **Restreindre par défaut les nouveaux jeux de données** si vous désirez que tous les nouveaux jeux de données que vous créerez soient uniquement accessible aux utilisateurs autorisés.

source: The **landing page for anonymous users** can be set to any content page created on the domain. It makes it possible to host a splash screen or to disclose content to anonymous users from a private domain.
fr: La **page de renvoi pour utilisateurs anonymes** peut être n'importe quelle page de contenu créée sur le domaine. Cette options permet d'héberger une page d’accueil ou de donner des informations aux utilisateurs anonymes sur un domaine privé.

source: This section also allows you to define the **default permissions for new users** (see below for a detailed description of users permissions).
fr: Cette section permet aussi de définir des valeurs par défaut de **permissions des nouveaux utilisateurs** (la description détaillée des permissions des utilisateurs est plus bas).

source: Domain access list
fr: Liste d'accès au domaine

source: The domain access list are made of users and groups. Users' scope is platform wide (this means that a user can be associated with more than one domain) while groups' scope is domain wide (groups are not shared among domains).
fr: La liste d'accès au domaine est composée d'utilisateurs et de groupes. Le concept d'utilisateur s'étend à l'ensemble de la plateforme OpenDataSoft (cela veut dire qu'un utilisateur peut être sur plus d'un domaine), alors qu'un groupe ne peut exister que sur un seul domaine.

source: The effective permissions of a user are the union of the user's own permissions and of the permissions of the groups the user belongs to. This means that if a user does not have administrative rights set while they belong to a group which has administrative rights, the user will effectively be given administrative rights.
fr: Les permissions effectives d'un utilisateur sont calculée en prenant l'union des permissions de l'utilisateur et des permissions des groupes auxquels l'utilisateur appartient. Cela veut dire que si un utilisateur n'a pas de droits d'administrateur, mais appartient à un groupe qui a des droits administrateurs, les permissions effectives de l'utilisateur comprendront ces droits d'administrateurs.

source: There are two categories of **permissions**: standard permissions and administative permissions. Permissions can be attributed to users and groups.
fr: Il y a deux catégories de **permissions**: les permissions standard et les permissions d'administrateurs. Les permissions peuvent êtres attribuées aux utilisateurs et aux groupes.

source: Standard permissions
fr: Permissions standard

source: The user may create new datasets and edit them
fr: L'utilisateur peut créer de nouveaux jeux de données et éditer ceux-ci

source: The user may publish their datasets
fr: L'utilisateur peut publier ses propres jeux de données

source: The user may manage the security settings of their datasets
fr: L'utilisateur peut gérer les options de sécurité de ses propres jeux de données

source: Administrative permissions
fr: Permissions administratives

source: The user may browse all the datasets on the domain
fr: L'utilisateur peut consulter tous les jeux de données du domaine

source: The user may edit all the datasets on the domain
fr: L'utilisateur peut éditer tous les jeux de données du domaine

source: The user may create and edit content pages on the domain
fr: L'utilisateur peut créer et modifier des pages de contenu sur le domaine

source: The user may edit and moderate reuses on the domain
fr: L'utilisateur peut modifier et modérer les réutilisations du domaine

source: The user may edit domain properties
fr: L'utilisateur peut modifier les propriétés du domaine

source: Dataset access list
fr: Liste d'accès d'un jeu de données

source: As seen above, a **restricted** dataset can only be accessed by users defined in the access list of the dataset, users belonging to a group defined in the access list of the dataset or users with special administrative permissions.
fr: Comme vu plus haut, un jeu de données **restreint** ne peut être consulté que par les utilisateurs définis dans la liste d'accès de ce jeu de données, par les utilisateurs appartenant à un groupe défini dans la liste d'accès du jeu de données et enfin par les utilisateurs possédant des permissions d'administrateur spécifiques.

source: Users and groups can easily be added to the access list of a dataset.
fr: Les utilisateurs et groupes peuvent facilement être ajoutés à la liste d'accès d'un jeu de données.

source: If a user belongs to the access list of a dataset (or to a group which belongs to the access list of a dataset), they may access this dataset in the exploration console or through APIs. Two additional permissions are also available:
fr: Si un utilisateur est dans la liste d'accès d'un jeu de données (où dans un groupe qui est dans cette liste d'accès), il peut accéder à ce jeu de données dans la console d'exploration ou par les API. Deux permissions supplémentaires sont également disponibles:

source: The user may edit the dataset
fr: L'utilisateur peut modifier le jeu de données

source: The user may publish the dataset
fr: L'utilisateur peut publier le jeu de données

source: For non restricted datasets, filters defined in the **default security** section apply to anonymous users or to authenticated users who do not belong to the access list.
fr: Pour les jeux de données non-restreint, les filtres définis dans la section **sécurité par défaut** s'appliquent aux utilisateurs anonymes et aux utilisateur authentifiés qui n'appartiennent pas à la liste d'accès.

source: The effective filter of a user belonging to the access list of a dataset is the union of the users's filters and the filters of the groups the user belongs to.
fr: Le filtre effectif d'un utilisateur appartement à la liste d'accès d'un jeu de données est l'union des filtres de l'utilisateur et des filtres des groupes auxquels l'utilisateur appartient.

source: Users management workflow
fr: Le processus de gestion des utilisateurs

source: As an administrator, you can add users to your domain directly through your users management screen. You can also activate a registration workflow to let users initiate the registration process themselves.
fr: En tant qu'administrateur, vous pouvez ajouter des utilisateurs sur votre domaine depuis l'écran de gestion des utilisateurs. Vous pouvez aussi activer un processus d'inscription pour permettre aux utilisateurs de débuter leur enregistrement au domaine par eux-même.

source: Manually adding users to the domain
fr: Ajouter des utilisateurs au domaine manuellement

source: To do so, simply hit the **add users** button. You can then either search for an existing user on the platform (remember that user management is platform wide) or simply invite new users by entering their email addresses. New users will receive an email asking them to validate their account.
fr: Pour ce faire, cliquez sur le bouton **ajouter des utilisateurs**. Vous pouvez soit chercher un utilisateur existant sur la plateforme (comme évoqué plus haut, les utilisateurs sont globaux à la plateforme OpenDataSoft) ou invitez de nouveaux utilisateurs en indiquant leurs adresses e-mail. Les utilisateurs que vous invitez recevront un e-mail qui leur permettra de valider leur compte.

source: Configuring the registration workflow
fr: Configurer le processus d'inscription

source: It is also possible to configure the registration workflow. This workflow allows users to sign up by themselves. A registration can either be manually or automatically validated, depending on the configuration. A set of fields allows you to customize the signup page.
fr: Il est également possible de configurer le processus d'inscription. Ce processus permet aux utilisateurs de s'enregistrer par eux même. Le domaine peut être configuré de façon à ce que les demandes d'inscription soient validées manuellement ou automatiquement. Une suite de champs permettent de personnaliser la page d'inscription.
