Repository: cclauss/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/getting_started/features.po
Languages: fr

source: Feature List
fr: Liste des fonctionnalités

source: The OpenDataSoft platform includes a wide range of features from data integration to data analysis and publishing.
fr: La plateforme OpenDataSoft inclut un large éventail de fonctionnalités allant de l'intégration de données à l'analyse et la publication.

source: The below table lists the major features of the platform.
fr: La liste ci-dessous recense les fonctionnalités majeures de la plateforme.

source: Data collection
fr: Collecte de données

source: Feature
fr: Fonctionnalité

source: Comments
fr: Commentaires

source: Data files upload
fr: Téléchargement (envoi) de fichier de données

source: OpenDataSoft natively supports a wide range of structured file formats: CSV, XLS, XLSX, SHP, KML, GeoJSON, OSM, GTFS.
fr: OpenDataSoft supporte nativement une large liste de formats structurés : CSV, XLS, XLSX, SHP, KML, GeoJSON, OSM, GTFS.

source: Remote web services support
fr: Support des web-services distants

source: Custom connectivity
fr: Connectivité sur mesure

source: OpenDataSoft can integrate, on demand, custom data parsers or custom connectors.
fr: OpenDatasoft peut intégrer sur demande des connecteurs ou traitements de données sur mesure.

source: Data federation
fr: Fédération de données

source: This feature makes it possible for customers to share data in a simple way avoiding data duplication.
fr: Cette fonctionnalité permet le partage de données d'une façon simple et sans duplication de l'information.

source: Data processing
fr: Traitement de données

source: Geocoding
fr: Géocodage

source: Requires for the customer to have a valid contract with Google or ESRI.
fr: Nécessite pour le client un contrat valide avec Google ou Esri.

source: Text transformations
fr: Transformations de texte

source: See :doc:`Processors </publish_datasets/processors>`.
fr: Voir :doc:`Processeurs </publish_datasets/processors>`.

source: Join
fr: Jointure

source: Numeric operations
fr: Opérations numériques

source: Custom transformation
fr: Transformation sur mesure

source: Indexing
fr: Indexation

source: OpenDataSoft's features are extensively based on the indexing of raw data of datasets.
fr: Les fonctionnalités OpenDataSoft sont basées sur l'indexation de données brutes des jeux de données.

source: Data sharing
fr: Partage de données

source: Fuzzy text search
fr: Recherche textuelle approximative

source: Multi-criteria search
fr: Recherche multi-critères

source: Data catalog API
fr: API de catalogue de données

source: Data catalog export
fr: Export de catalogue de données

source: The data catalog can be exported in CSV, RSS and RDF.
fr: Le catalogue de données peut être exporté en CSV, RSS et RDF.

source: Linked data capabilities
fr: Fonctionnalités "Linked data"

source: The data catalog can easily be exported in RDF (turtle).
fr: Le catalogue de données peut être exporté facilement en RDF (turtle).

source: Data APIs
fr: APIs de données

source: All the datasets are automatically made available through a standardized API entry point.
fr: Tous les jeux de données sont rendus disponibles automatiquement ) travers des points d'entrées d'APIs standards.

source: Data export
fr: Export de données

source: CSV, JSON, XLS, SHP (when relevant), GeoJSON (when relevant)
fr: CSV, JSON, XLS, SHP (si applicable), GeoJSON (si applicable)

source: Customizable User Interface
fr: Interface utilisateur personnalisable

source: Embeddable widgets
fr: Composants intégrables

source: Note also that the widgets built by OpenDataSoft to display data have been released in Open Source. See `<https://github.com/opendatasoft/ods-widgets>`_.
fr: Notez également que les composants créés par OpenDataSoft pour afficher les données sont disponibles en Open Source. Voir `<https://github.com/opendatasoft/ods-widgets>`_.

source: Geo data visualization
fr: Visualisation de données géographiques

source: Analytics data visualization
fr: Visualisation de données analytiques

source: Image gallery
fr: Galerie d'images

source: Content
fr: Contenu

source: Hosting custom content
fr: Hébergement de contenu personnalisé

source: The OpenDataSoft platform natively includes a simple CMS for customers to write custom content (home page, showcase page, apps page...)
fr: La plateforme OpenDataSoft inclut nativement un simple CMS pour écrire du contenu personnalisé (page d'accueil, page de démonstration, page d'applications...).

source: CMS style edition
fr: Edition façon CMS

source: Embed data visualization in content pages
fr: Intégrer des visualisations de données dans des pages de contenu

source: User engagement
fr: Engagement utilisateur

source: OpenDataSoft integrates with `Disqus <https://disqus.com/>`_. Disqus threads can be integrated at an instance level or at a dataset level.
fr: OpenDataSoft s'intègre avec `Disqus <https://disqus.com/>`_. Les fils Disqus peuvent être intégrés au niveau du domaine ou d'un jeu de données.

source: Contact form
fr: Formulaire de contact

source: Reuse management
fr: Gestion des réutilisations

source: Reusers can easily submit reuse proposals. A validation workflow let admins promote reuses on their OpenDataSoft instance.
fr: Les utilisateurs peuvent facilement soumettre des réutilisations. Un processus de validation permet aux administrateurs de mettre en valeur les réutilisations sur leur portail.

source: Hosting & admin
fr: Hébergement & administration

source: User management
fr: Gestion des utilisateurs

source: User groups management
fr: Gestion des groupes d'utilisateurs

source: Self-subscription workflow
fr: Processus d'inscription self-service

source: Data access control
fr: Contrôle d'accès aux données

source: Access quotas management
fr: Gestion des quotas d'accès

source: SSO support
fr: Support SSO

source: Google Analytics integration
fr: Intégration Google Analytics

source: Native API monitoring
fr: Monitoring d'API natif

source: OpenDataSoft includes fine grained API monitoring features.
fr: OpenDataSoft inclut des fonctionnalités de monitoring détaillé d'API.

source: Cloud hosting
fr: Hébergement cloud

source: Free test plan
fr: Essai gratuit

source: Multi cloud support
fr: Support multi-cloud
