Repository: cclauss/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/sourcing_and_processing_data/configuring_visualizations/map.po
Languages: it

source: Configuring the map view
it: Configurazione della visualizzazione delle mappe

source: The map view is only available to datasets containing at least one geo field (geo point or geo shape).
it: La visualizzazione delle mappe è disponibile solo per i dataset contenenti almeno un campo geografico (geopoint o geoshape).

source: You can configure the appearance of the map itself:
it: È possibile configurare l'aspetto della mappa:

source: If a tooltip displays more than one item (when multiple records have the same location for example), you can set their relative order
it: Se un tooltip visualizza più di una voce, ad esempio nel caso in cui più record abbiano la stessa ubicazione, puoi impostarne l'ordine.

source: If you have more than one basemap on your domain, you can set which one is selected by default for this dataset (otherwise it is the first one in the list)
it: Se disponi di più di una mappa di base per il tuo dominio, puoi impostare quale selezionare in modo predefinito per il dataset in questione, in caso contrario verrà scelta la prima dell'elenco.

source: The color of the shapes and points displayed on the map
it: Puoi impostare il colore delle forme e dei punti mostrati sulla mappa.

source: If the data is represented as points, you can configure how it is displayed: a simple icon, little dots, or a familiar marker
it: Se i dati sono rappresentati come punti, puoi configurarne la visualizzazione, con una semplice icona, con piccoli punti o con un marcatore familiare.

source: The map view options
it: Opzioni di visualizzazione delle mappe

source: Setting up the tooltip
it: Configurazione del tooltip

source: On a map, a click on a point will bring forward a tooltip containing more information
it: Su una mappa, clicca su un punto per aprire un tooltip contenenti maggiori informazioni.

source: You can :doc:`configure the tooltip</sourcing_and_processing_data/configuring_visualizations/tooltip>` in exactly the same way than for the image gallery or the calendar.
it: Puoi You can :doc:`configurare il tooltip</sourcing_and_processing_data/configuring_visualizations/tooltip>` esattamente nello stesso modo in cui configuri la galleria delle immagini e il calendario.
