Repository: cclauss/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/sourcing_and_processing_data/configuring_visualizations/tooltip.po
Languages: it

source: Configuring the tooltip
it: Configurazione dei tooltip

source: In order to display information on a map, on a image or in a calendar, you can configure a tooltip. You can use, and configure, the standard tooltip or customize it more precisely using a custom HTML tooltip. A custom tooltip is slightly more time consuming but it is a good way to leverage your data. To switch from the standard tooltip configuration interface to this custom tooltip view, select Custom HTML template from the tooltip type dropdown menu.
it: Per visualizzare le informazioni su una mappa, un'immagine o un calendario, è possibile configurare un tooltip. Puoi utilizzare e impostare un tooltip standard o scegliere un tooltip HTML personalizzato. La configurazione di un tooltip personalizzato richiede un po' più di tempo ma può ottimizzare l'utilizzo dei dati. Per passare dall'interfaccia di configurazione dei tootip standard alla personalizzazione, seleziona il modello Tootip HTML personalizzato dal menu a discesa Tipo di tooltip.

source: Setting up the tooltip
it: Configurazione del tooltip

source: Standard tooltip
it: Tooltip standard

source: You can of course configure which fields will appear in the tooltip and their relative order. A live preview is available on the right side.
it: Naturalmente, puoi configurare i campi che verranno visualizzati nel tooltip e il relativo ordine. Sulla destra è disponibile un'anteprima dinamica.

source: For each of the tooltip's fields, the 3 following actions are available :
it: Per ognuno dei campi dei tooltip sono disponibili le seguenti 3 azioni:

source: Tooltip's fields' actions
it: Azioni consentite sui campi del tooltip

source: Drag and drop to move field within tooltip
it: Transcina e rilascia per spostare un campo del tooltip

source: Click to remove field from tooltip
it: Clicca per rimuovere un campo del tooltip

source: Click to add field to tooltip
it: Clicca per aggiungere un campo al tooltip

source: The associated live preview
it: Visualizzazione dinamica associata

source: Custom HTML tooltip
it: Tooltip HTML personalizzato

source: When you select `Custom HTML tooltip` an HTML editor appears. This is very similar to writing "pages" in your domain; you have access to every `ODS Widget <http://opendatasoft.github.io/ods-widgets/docs/>`_ and you can even integrate other visualizations inside the tooltip. You can even use the :doc:`grid layout classes</customizing_look_and_feel/responsive/>`.
it: Selezionando `Tooltip HTML personalizzato` si apre un editor HTML, il cui funzionamento è simile alla scrittura delle "pagine" del tuo dominio. Da qui potrai accedere a tutti i `widget ODS <http://opendatasoft.github.io/ods-widgets/docs/>`_ e potrai integrare altre visualizzazioni, oltre a utilizzare le :doc:`classi di layout della griglia</customizing_look_and_feel/responsive/>`.

source: An example of a custom tooltip.
it: Esempio di tooltip personalizzato.

source: When the tooltip is displayed, it can access a specific ``record`` variable that is "injected" in the tooltip. This ``record`` object contains the following properties:
it: Quando viene visualizzato, il tooltip può accedere a una specifica variabile ``record`` che viene inserita nel tooltip. Questo oggetto ``record`` include le seguenti proprietà:

source: ``record.fields``: object containing all the values (e.g. ``record.fields.tree_height``)
it: ``record.fields``: oggetto contenente tutti i valori, ad esempio ``record.fields.tree_height``.

source: ``record.recordid``: unique identifier for the record
it: ``record.recordid``: identificativo univoco del record.

source: ``record.datasetid``: identifier of the dataset
it: ``record.datasetid``: identificativo del dataset.

source: Using these properties, you can display directly values in the tooltip, or even use them to display data from other datasets.
it: Mediante queste proprietà è possibile visualizzare i valori direttamente tooltip o utilzzarli per mostrare i dati di altri dataset.

source: The schema of the dataset is also injected as a ``fields`` variable, which is an array of field objects (you can use ``ng-repeat`` to loop over the fields). A field object contains the following properties:
it: Anche lo schema del dataset viene inserito come variabile ``fields``, costituita da un array di oggetti campo. Per eseguire un ciclo cui campi utilizza ``ng-repeat``. Un oggetto campo include le seguenti proprietà:

source: ``field.name``: the identifier of the field, for example to find a value within ``record.fields``
it: ``field.name``: identificativo del campo, ad esempio per trovare un valore in ``record.fields``.

source: ``field.type``: the type of the field (``text``, ``decimal``, ``integer``, ``date``, ``datetime``, ``geo_point_2d``, ``geo_shape``)
it: ``field.type``: tipo del campo (``text``, ``decimal``, ``integer``, ``date``, ``datetime``, ``geo_point_2d``, ``geo_shape``).

source: ``field.label``: a human-friendly label
it: ``field.label``: etichetta descrittiva.

source: Here is the code from the example above:
it: Dall'esempio riportato sopra si ottiene il seguente codice:

source: If you want to display an image from one of your dataset's ``file`` fields, you can use the ``ods-record-image`` widget.
it: Per visualizzare l'immagine di uno dei campi ``file`` del dataset è possibile utilizzare il widget ``ods-record-image``.

source: You can use a ``<ods-dataset-context>`` to display a visualization from another dataset; in the following example, the data is taken from another dataset and filtered using one of the values of the selected record.
it: ``<ods-dataset-context>`` permette fornisce la visualizzazione di un altro dataset. Nell'esempio seguente, i dati provengono da un altro dataset e sono filtrati in base a uno dei valori del record selezionato.
