Repository: cclauss/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/using_api/v1/available_apis.po
Languages: it

source: Available APIs
it: API disponibili

source: OpenDataSoft datasets can be accessed by developers through HTTP REST APIs.
it: Gli sviluppatori possono accedere ai dataset OpenDataSoft mediante le API REST HTTP.

source: The domain `<http://public.opendatasoft.com>`_ will be use to illustrate examples given in this forum.
it: Gli esempi utilizzati di seguito si basano sul dominio `<http://public.opendatasoft.com>`_.

source: The available APIs are listed below.
it: La tabella seguente riporta le API disponibili.

source: API Name
it: Nome API

source: API Short Description
it: Breve descrizione dell'API

source: Search datasets
it: Ricerca dei dataset

source: Find a dataset based on its identifier
it: Ricerca di un dataset in base al relativo identificativo

source: Search records within a specific dataset
it: Ricerca di record in uno specifico dataset

source: Build advanced aggregations using records of a specific dataset
it: Creazione di aggregazioni avanzate basate sui record di uno specifico dataset

source: Efficiently download a large number of records from a specific dataset
it: Download efficiente di grandi volumi di record da uno specifico dataset

source: Build geo clusters using records of a specific dataset
it: Creazione di cluster geografici basati sui record di uno specifico dataset

source: Real time data integration
it: Integrazione dei dati in tempo reale

source: Download multimedia content attached with datasets or records
it: Download del contenuto multimediale allegato a dataset o a record

source: All these APIs (except the Multimedia download API) return JSON by default. Some of them can return alternate content.
it: Per impostazione predefinita, tutte queste API, salvo l'API per il download multimediale, restituiscono un contenuto in formato JSON. Alcune possono restituire un contenuto alternativo.

source: All these APIs (except the Real Time Push API) support cross-domain access from a browser, using CORS (`<http://en.wikipedia.org/wiki/Cross-origin_resource_sharing>`_). For older browsers or other specific purposes, JSONP (`<http://en.wikipedia.org/wiki/JSONP>`_) is supported when returning JSON content by adding a ``callback`` parameter.
it: Tutte queste API, salvo l'API push in tempo reale, supportano l'accesso tra domini diversi da browser, tramite CORS (`<http://en.wikipedia.org/wiki/Cross-origin_resource_sharing>`_ - Condivisione di risorse tra origini diverse). Per browser di versioni precedenti o altri scopi specifici, aggiungendo il parametro ``callback`` nella restituzione di contenuto JSON è supportato anche il formato JSONP (`<http://en.wikipedia.org/wiki/JSONP>`_).

source: Finding the dataset identifier
it: Come individuare l'identificativo del dataset

source: You are looking for specific data to build your application but you don't know yet in which dataset you can find these data?
it: È possibile ricercare dati specifici per creare un'applicazione anche se non si conosce il dataset in cui sono contenuti.

source: You can simply use the exploration console by clicking on the "Explore" link in the top page menu. Once you have identified the dataset you need, just go to this dataset's "Information" tab where you'll find the dataset id.
it: A questo scopo utilizza la console di esplorazione, cliccando sul link "Esplora" nel menu all'inizio della pagina. Dopo aver identificato il dataset desiderato, apri la relativa scheda "Informazioni", dove troverai il suo ID.

source: HTTP Methods
it: Metodi HTTP

source: Except for the Real Time Push API which respects more strictly RESTful concepts, all the APIs endpoints accept GET and POST HTTP methods. GET methods shall be prefered of course. The POST can be used to workaround browsers / libraries / proxies limitations regarding the size of the HTTP URL.
it: Ad eccezione dell'API push in tempo reale, che si basa su regole RESTful più rigorose, tutti gli endpoint delle API accettano i metodi HTTP POST e GET. I metodi GET sono naturalmente preferibili. POST può essere utilizzato per ovviare ai limiti posti da browser, librerie o proxy alle dimensioni dell'URL HTTP.

source: Security
it: Sicurezza

source: All the APIs are secured using the same authentication and authorization model.
it: Tutte le API sono protette dallo stesso modello di autenticazione e di autorizzazione.

source: Users can only see what they are allowed to see:
it: Gli utenti possono visualizzare solo ciò per cui dispongono delle autorizzazioni appropriate:

source: Datasets in a domain
it: dataset di un dominio

source: Records in a dataset
it: record di un dataset

source: APIs are available both in HTTP and HTTPS. We advise API users to always use the HTTPS endpoint.
it: Le API sono disponibili in versione sia HTTP sia HTTPS, ma è consigliabile utilizzare sempre endpoint HTTPS.

source: The following authentication modes are available:
it: Sono disponibili le seguenti modalità di autenticazione:

source: **Basic HTTP authentication:** Provide your account's login and password (`<http://en.wikipedia.org/wiki/Basic_access_authentication>`_)
it: **Autenticazione HTTP di base**: richiede l'immissione del login e della password dell'account (`<http://en.wikipedia.org/wiki/Basic_access_authentication>`_ - Autenticazione di accesso di base).

source: **Simple key authentication:** Provide an API key you generated for your account (API keys work on any domain an OpenDataSoft user has access to)
it: **Autenticazione con chiave semplice**: richiede una chiave API generata per l'account specifico (le chiavi API funzionano su qualsiasi dominio a cui l'utente OpenDataSoft ha accesso).

source: Note that when you are connected with a Browser session, API calls triggered from that browser will reuse your current credentials.
it: Tieni presente che quando sei connesso con la sessione di un browser, le chiamate delle API che provengono da esso riutilizzano le credenziali correnti.

source: Quotas
it: Quote

source: APIs endpoints are subject to quota-based limitations. Contact the domain administrator or the dataset owner when you reach a limit.
it: Gli endpoint delle API sono soggetti alle limitazioni previste dalle quote. Quando raggiungi uno di questi limiti, ti preghiamo di contattare l'amministratore del dominio o il proprietario del dataset.

source: The API response contains three headers to indicate the current state of your quota:
it: La risposta dell'API contiene tre header che indicano lo stato corrente della quota:

source: **X-RateLimit-Limit** indicates the total number of API calls you can do in a single day (resets at midnight UTC)
it: **X-RateLimit-Limit**, che indica il numero totale di chiamate API consentite in un singolo giorno e che viene azzerato alla mezzanotte, orario UTC.

source: **X-RateLimit-Remaining** indicates the number of API calls currently remaining
it: **X-RateLimit-Remaining**, che indica il numero delle chiamate API rimanenti.

source: **X-RateLimit-Reset** indicates the `epoch <http://en.wikipedia.org/wiki/Unix_time>`_ of the next reset time
it: **X-RateLimit-Reset**, che indica il `tempo <http://en.wikipedia.org/wiki/Unix_time>`_ dell'ultimo azzeramento.

source: Errors handling
it: Gestione degli errori

source: When an error occurs, a JSON object describing the error is returned by the API.
it: Quando si verifica un errore, l'API restituisce un oggetto JSON contenente una descrizione.

source: Example of an error occuring when you reach a quota limit:
it: Esempio di errore verificatosi al raggiungimento del limite di una quota:
