Repository: cclauss/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/monitoring_audience/analyzing_data_usage.po
Languages: it

source: Analyzing data usage
it: Analizzare l'utilizzo dei dati

source: Go to the *Analytics > Data* page.
it: Fai clic su *Statistiche > Dati*.

source: There are seven indicators :
it: Sono disponibili sette indicatori:

source: **Dataset activity**: Download and API calls of most used datasets. Please note that there are two different scales for the downloads count and the number of API calls on each side of the chart.
it: **Attività dei dataset**: Numero di download e di chiamate API per i dataset più utilizzati. Nota che ai lati del grafico sono presenti due diverse scale di misura, una dedicata alle chiamate API e l'altra al numero di download.

source: **Total datasets**: Total number of datasets in the catalog.
it: **Totale dei dataset**: numero totale dei dataset presenti nel catalogo.

source: **Total records**: Total number of records in the catalog.
it: **Record totali**: Numero totale dei record nel catalogo.

source: **Top datasets**: The 3 datasets with most API calls. Those are the datasets that drive the usage on your portal.
it: **Dataset più popolari**: I 3 dataset con il maggior numero di chiamate API. Sono quelli che guidano le statistiche degli utilizzi sul tuo portale.

source: **Least used datasets**: The 3 datasets with least API calls. Those datasets may have not met their audience yet.
it: **Dataset meno utilizzati**: I 3 dataset con il minor numero di chiamate API. Questi dataset potrebbero non aver ancora raggiunto un pubblico adatto alle loro caratteristiche.

source: **Theme popularity**: Distribution of popularity among themes. Allows you to understand what data your users look for.
it: **Popolarità del tema**: Distribuzione della popolarità dei dataset in base ai temi. Ti consente di capire quali tipologie di dati vengono cercate dai tuoi utenti.

source: **Tag cloud**: Distribution of popularity among tags. Allows you to understand what data your users look for.
it: **Tag cloud**: Distribuzione della popolarità dei dataset in base ai tag. Ti consente di capire quali dati vengono cercati dai tuoi utenti.
