Repository: cclauss/ods-documentation
Catalog: source/_locale/*/LC_MESSAGES/explore/simple_charts.po
Languages: fr

source: Building Simple Charts
fr: Construire des graphiques simples

source: The OpenDataSoft platform lets you easily build charts using the published datasets. Let's first study single dataset charts.
fr: OpenDataSoft permet de créer simplement des graphiques à partir de jeux de données publiés sur la plateforme. Commençons par étudier les graphiques utilisant un unique jeu de données.

source: We will use as a sample a simple dataset containing 3 fields:
fr: Nous allons utiliser pour exemple un simple jeu de données comprenant 3 champs :

source: The **country** field, a *text* field defined as a *facet*
fr: Le champ **pays**, un champ *text* définis comme *facette*

source: The **year** field, a *date* field with a *year* precision and defined as a *facet*
fr: Le champ **année**, un champ *date* avec une précision à l'année et définis comme *facette*

source: The **inhabitants** field, an *integer* field
fr: Le champ **habitants**, un champ *integer*

source: Remember that without facets, you cannot do any data analysis! To access the charts section for you dataset, simply go the **Analysis** tab.
fr: Rappelez vous que sans facette, il n'est pas possible d'analyser les données ! Pour accéder à la création de graphiques pour votre jeu de données, allez à l'onglet **Analyse**.

source: Note also that for the sake of simplicity, we've illustrated this article with a very small dataset. But the below also applies to datasets with millions of rows.
fr: Notez que, pour des raisons de simplicité, nous avons illustré cet article avec un petit jeu de données. Mais cela s'applique de la même façon à des jeux de données de millions d'enregistrements.

source: A basic chart
fr: Un graphique simple

source: By default, the interface displays the default chart configured by the dataset owner. You can however play with the interface to shape a totally new chart.
fr: Par défault, l'interface affiche le graphique définit par le propriétaire du jeu de données. Vous pouvez néanmoins jouer avec l'interface pour créer un graphique totalement nouveau.

source: The above chart is the default chart for our dataset, which shows the evolution of the average number of inhabitants per country from 2020 to 2040.
fr: Le graphique ci-dessus est celui par défault pour notre jeu de données. Il montre l'évolution du nombre moyen d'habitants par pays entre 2020 et 2040.

source: The first set of options are related to the "X" axis configuration. You can choose which field (facet) is going to be used as the first dimension. For date and datetime fields, you can select the precision to be used (from **year** to **minute**).
fr: La première série d'options concerne la configuration de l'abscisse (axe "X"). Vous pouvez choisir quel champ (facette) sera utilisée comme première dimension. Pour les champs date et datetime, vous pouvez sélectionner la précision à utiliser (de l'**année** à la **minute**).

source: The second set of options lets you define series.
fr: La deuxième série d'options vous permet de définir les séries.

source: About series
fr: A propos des séries

source: A serie is simply the aggregation of a value on the "X" axis. Think about it as a database group by.
fr: Une série est simplement l'aggrégation d'une value sur l'axe "X". Vous pouvez les voir comme un group by dans une base de données.

source: In the example above, we've defined two series:
fr: Dans l'exemple ci-dessus, nous avons définit deux séries :

source: The first serie represents the maximum number of inhabitants per country.
fr: La première série représente le nombre maximum d'habitants par pays.

source: The second serie represents the sum of the number of inhabitants.
fr: La seconde série représente la somme des habitants.

source: Series can be represented in various ways:
fr: Les séries peuvent être représentées de différentes façons :

source: Line
fr: Ligne

source: Spline
fr: Courbe

source: Range
fr: Enveloppe

source: Range spline
fr: Enveloppe courbe

source: Column range
fr: Enveloppe par colonnes

source: Area
fr: Zone

source: Area spline
fr: Zone et courbe

source: Column chart
fr: Colonnes

source: Bar chart
fr: Barres

source: Pie chart
fr: Camembert

source: Scatter plot
fr: Nuage de points

source: In the case of *range*, *range spline* and *column range* representations, you may configure the lower and upper boundaries with two different series.
fr: Dans les cas de représentation par *enveloppe*, *enveloppe courbe* et *enveloppe par colonnes*, vous pouvez configurer les limites haute et basse avec deux séries différentes.

source: The following aggregation methods are available:
fr: Les méthodes d'aggrégation suivantes sont disponibles :

source: Count (simply counts the number of records)
fr: Compte (compte simplement le nombre d'enregistrements)

source: Average
fr: Moyenne

source: Standard deviation
fr: Déviation standard

source: Sum
fr: Somme

source: Percentile (you'll need to choose the percentile value, from 1 to 100 - 50 for the median)
fr: Percentile (vous aurez besoin de choisir la valeur du pourcentile, entre 1 et 100 - 50 pour la médianne)

source: Constant value (can be used to represent thresholds)
fr: Valeur constante (peut être utilisée pour représenter des seuils)

source: You can also choose which numerical field shall be aggregated (except for the *Count* and *Constant value* functions). And you can on the same graph mix series with aggregations on different fields.
fr: Vous pouvez aussi choisir quel champ numérique sera aggrégé (sauf pour les fonctions *Compte* et *Valeur constante*). Vous pouvez aussi, sur le même graphique mélanger des séries avec des aggrégation sur des champs différents.

source: About break down
fr: A propos de la ventilation

source: Break down lets you introduce a second dimension in your analysis. As always, you can only break down on facets.
fr: La ventilation des séries permet d'introduire une seconde dimension dans votre analyse. Comme à chaque fois, vous ne pouvez ventiler les séries que sur des champs facettés.

source: When break down is activated, you can also choose the stacking mode for your series:
fr: Lorsque la ventilation est activée, vous pouvez aussi choisir le mode d'empilement pour votre série :

source: **No stack** means that series will simply be displayed indenpendently
fr: **Pas d'empilement** signifie que les séries seront affichées de façon indépendantes.

source: **Normal** (as in the above sample) simply stacks series
fr: **Normal** (comme dans l'exemple ci-dessus) empile simplement les séries

source: **Percent** will stack map the series to a 1 - 100 scale
fr: **Pourcent** empile les séries sur une échelle de 1 à 100
